conf/src/Documents/ЭП_ПеремещениеНоменклатуры/ЭП_ПеремещениеНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭП_ПеремещениеНоменклатуры</name>
  <registerRecords>InformationRegister.ЭП_КачествоНоменклатуры</registerRecords>
  <registerRecords>AccumulationRegister.ЭП_ОстаткиНаСкладе</registerRecords>
  <attributes>
    <name>СкладОтправитель</name>
    <type>
      <types>CatalogRef.ЭП_Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.ЭП_Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.ЭП_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидНоменклатуры</name>
      <type>
        <types>CatalogRef.ЭП_ВидНоменлкатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КачествоНоменклатуры</name>
      <type>
        <types>CatalogRef.ЭП_КачествоНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

conf/src/AccumulationRegisters/ЭП_ОстаткиНаСкладе/ЭП_ОстаткиНаСкладе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЭП_ОстаткиНаСкладе</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.ЭП_Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.ЭП_Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

conf/src/InformationRegisters/ЭП_КачествоНоменклатуры/ЭП_КачествоНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭП_КачествоНоменклатуры</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>КачествоНоменклатуры</name>
    <type>
      <types>CatalogRef.ЭП_КачествоНоменклатуры</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.ЭП_Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/Documents/ЭП_ПеремещениеНоменклатуры/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

 &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры  

#КонецОбласти 

 #Область ОбработчикиСобытийТаблицыНоменклатура

 &НаКлиенте
Процедура НоменклатураИнвентарныйНомерОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	НоменклатураИнвентарныйНомерПолучениеНоменклатуры(ВыбранноеЗначение, Элементы.Номенклатура.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураИнвентарныйНомерАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
		
	Если ПустаяСтрока(Текст) Тогда 
		
		ДанныеВыбора = ПолучитьДанныеВыбораПоИнвентарномуНомеру(Элемент, Элементы.Номенклатура.ТекущиеДанные.ИнвентарныйНомер,
		Элементы.Номенклатура.ТекущиеДанные.Номенклатура, 
		Объект.СкладОтправитель, Элементы.Номенклатура.ТекущиеДанные.ВидНоменклатуры, 
		СтандартнаяОбработка); 
		
	Иначе
		
		ДанныеВыбора = ПолучитьДанныеВыбораПоИнвентарномуНомеру(Элемент, Текст, Элементы.Номенклатура.ТекущиеДанные.Номенклатура, 
		Объект.СкладОтправитель, Элементы.Номенклатура.ТекущиеДанные.ВидНоменклатуры, СтандартнаяОбработка);	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	 ОбработатьПодборНаСервере(ВыбранноеЗначение); 
	 
 КонецПроцедуры  
 
 #КонецОбласти
 
 #Область ОбработчикиКомандФормы
 
 &НаКлиенте
Функция ПолучитьДанныеВыбораПоИнвентарномуНомеру(Элемент, Склад, Номенклатура, ИнвентарныйНомер, ВидНоменклатуры, СтандартнаяОбработка)

    СтандартнаяОбработка = Ложь;
                                                             
    ПараметрыПодбора = Новый Структура("Отбор,СтрокаПоиска,ВыборГруппИЭлементов",
                                Новый Структура(),                                 "",                                               
								ПредопределенноеЗначение("ИспользованиеГруппИЭлементов.Элементы"));
                                
    ПараметрыПодбора.Вставить("ДополнительныеПараметры", Новый Структура("Склад,Номенклатура, ИнвентарныйНомер, РежимРаботы, Сотрудник, ВидНоменклатуры",
                                                                           	Склад, 
                                                                            Номенклатура,
																			ИнвентарныйНомер, Истина, Ложь, ВидНоменклатуры));
    
    Возврат	ПолучитьДанныеВыбора(Тип("СправочникСсылка.ЭП_Номенклатура"), ПараметрыПодбора);

КонецФункции

&НаСервере
Функция НоменклатураИнвентарныйНомерПолучениеНоменклатуры(Текст, ИндексСтроки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭП_ОстаткиНаСкладеОстатки.Номенклатура КАК Номенклатура,
		|	ЭП_Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры
		|ИЗ
		|	РегистрНакопления.ЭП_ОстаткиНаСкладе.Остатки(
		|			,
		|			Склад = &Склад
		|				И ИнвентарныйНомер = &ИнвентарныйНомер) КАК ЭП_ОстаткиНаСкладеОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Номенклатура КАК ЭП_Номенклатура
		|		ПО ЭП_ОстаткиНаСкладеОстатки.Номенклатура = ЭП_Номенклатура.Ссылка
		|ГДЕ
		|	ЭП_ОстаткиНаСкладеОстатки.КоличествоОстаток > 0";
	
	Запрос.УстановитьПараметр("ИнвентарныйНомер", Текст);
	Запрос.УстановитьПараметр("Склад", Объект.СкладОтправитель);
	
	ВыборкаДетальныеЗаписи =  Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл   
		
		СтрокаТЧ = Объект.Номенклатура.НайтиПоИдентификатору(ИндексСтроки);
		СтрокаТЧ.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура; 
		СтрокаТЧ.ВидНоменклатуры = ВыборкаДетальныеЗаписи.ВидНоменклатуры; 

	КонецЦикла;	
	
КонецФункции

 &НаКлиенте
Процедура ПодобратьНоменклатуру(Команда)
	 
	 Если ЗначениеЗаполнено(Объект.СкладОтправитель) Тогда 
		 
		 ПарметрыПодбора = Новый Структура;
		 ПарметрыПодбора.Вставить("Склад", Объект.СкладОтправитель);
		 ПарметрыПодбора.Вставить("НоменклатураВыбор", Объект.Номенклатура);
		 ОткрытьФорму("Документ.ЭП_ПеремещениеНоменклатуры.Форма.ФормаПодбора", ПарметрыПодбора, ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		 
	 Иначе
		 
		 ПоказатьПредупреждение(,"Необходимо выбрать склад отправитель в документе для открытия формы подбора",,"Внимание!"); 
		 
	 КонецЕсли; 
	
КонецПроцедуры 

 #КонецОбласти  
 
 #Область СлужебныеПроцедурыИФункции
 
 &НаСервере
Процедура УстановитьУсловноеОформление()

	Элементы.СтатусДокумента.Доступность = ПроверкаРоли();
	Элементы.Ответственный.Доступность = ПроверкаРоли();
   	
КонецПроцедуры

&НаСервере
Функция ПроверкаРоли()
	
	Возврат Пользователи.РолиДоступны("ЭП_СогласованиеДокументовСклада",,);
	
КонецФункции

&НаСервереБезКонтекста
Функция ВидНоменклатурыАвтоПодборНаСервере(СтрокаПоиска) 
	
	Возврат Справочники.ЭП_ВидНоменлкатуры.ПолучитьДанныеВыбора(Новый Структура("СтрокаПоиска, ВводПоСтрокеРасширенный", СтрокаПоиска, Истина));

КонецФункции

&НаКлиенте
Процедура ВидНоменклатурыАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ВидНоменклатурыАвтоПодборНаСервере(Текст);

КонецПроцедуры

&НаСервере
 Процедура ОбработатьПодборНаСервере(АдресВременногоХранилища)
	 
	Объект.Номенклатура.Загрузить(ПолучитьИзВременногоХранилища(АдресВременногоХранилища));
	
КонецПроцедуры

&НаКлиенте
Процедура ВидНоменклатурыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыПередачи = Элементы.Номенклатура.ТекущиеДанные.Номенклатура;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОтборПоВиду", ПараметрыПередачи);
	ОткрытьФорму("Справочник.ЭП_ВидНоменлкатуры.ФормаВыбора",ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыПередачи = Элементы.Номенклатура.ТекущиеДанные.ВидНоменклатуры;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОтборПоВиду", ПараметрыПередачи);
	ОткрытьФорму("Справочник.ЭП_Номенклатура.ФормаВыбора",ПараметрыФормы, Элемент);
	
КонецПроцедуры

 #КонецОбласти
 
#Область АвтоматическоеЗаполнениеПоляКачествоНоменклатуры
 
 &НаСервере
Функция ПолучитьКачествоНоменклатуры(Номенклатура, ИнвентарныйНомер)   
	 Отбор = Новый Структура("Номенклатура, ИнвентарныйНомер", Номенклатура, ИнвентарныйНомер);
	 Возврат РегистрыСведений.ЭП_КачествоНоменклатуры.ПолучитьПоследнее(ТекущаяДатаСеанса(), Отбор).КачествоНоменклатуры;
КонецФункции

&НаКлиенте 
Процедура УстановитьКачествоНоменклатуры()
	СтрокаНоменклатуры = Элементы.Номенклатура.ТекущиеДанные;
	Если ЗначениеЗаполнено(СтрокаНоменклатуры.Номенклатура) И ЗначениеЗаполнено(СтрокаНоменклатуры.ИнвентарныйНомер) Тогда
		КачествоНоменклатуры = ПолучитьКачествоНоменклатуры(СтрокаНоменклатуры.Номенклатура, СтрокаНоменклатуры.ИнвентарныйНомер);
		Если КачествоНоменклатуры.Пустая() Тогда
			СтрокаНоменклатуры.КачествоНоменклатуры = ПредопределенноеЗначение("Справочник.ЭП_КачествоНоменклатуры.Новый");
		Иначе
			СтрокаНоменклатуры.КачествоНоменклатуры = КачествоНоменклатуры; 
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураНоменклатураПриИзменении(Элемент)
	УстановитьКачествоНоменклатуры();
КонецПроцедуры 

&НаКлиенте
Процедура НоменклатураИнвентарныйНомерПриИзменении(Элемент)
	УстановитьКачествоНоменклатуры();
КонецПроцедуры 

#КонецОбласти
